In [1]:
import sqlite3

In [2]:
%load_ext sql

In [3]:
%sql postgresql://robot-startml-ro:pheiph0hahj1Vaif@postgres.lab.karpov.courses:6432/startml

Задание 1
Сделайте запрос на все колонки из таблицы user. Для этого может понадобиться взять user в кавычки, вот так: "user" - чтобы PostgreSQL не спутал ее со своей встроенной таблицей user, где он ведет учет всех пользователей.

Напишите через пробел, с какого id начинаются записи и какой город у самого первого ID (на английском)

In [4]:
%%sql

SELECT * 
FROM "user"
LIMIT 1

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
1 rows affected.

[(200, 1, 34, 'Russia', 'Degtyarsk', 3, 'Android', 'ads')]

Задание 2
Отберите уникальные значения тем (topic) в таблице постов (post).

Напишите через пробел, сколько их и какой из них имеет самое длинное название.

In [5]:
%%sql

SELECT DISTINCT topic
FROM post

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
7 rows affected.

[('tech',),
 ('covid',),
 ('movie',),
 ('entertainment',),
 ('politics',),
 ('sport',),
 ('business',)]

Задание 3

Отберите пользователей старше 30 с устройством на iOS. Каков ID и город записи с минимальным ID (он идет первым в таблице)? Запишите значения через пробел.

In [6]:
%%sql

SELECT *
FROM "user"
WHERE age > 30 and os = 'iOS'
LIMIT 1

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
1 rows affected.

[(212, 1, 47, 'Russia', 'Podolsk', 0, 'iOS', 'ads')]

Задание 4
Отберите пользователей, которые не из России и при этом либо их экспериментальная группа не лежит в (0, 3) или их город – Минск.

Напишите через пробел первые 4 ID в такой выдаче.

In [7]:
%%sql

SELECT *
FROM "user"
WHERE (country != 'Russia') AND (exp_group NOT IN(0, 3) OR city = 'Minsk')
LIMIT 4

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
4 rows affected.

[(211, 1, 22, 'Belarus', 'Minsk', 0, 'iOS', 'ads'),
 (213, 1, 22, 'Ukraine', 'Kamianske', 2, 'iOS', 'ads'),
 (216, 0, 38, 'Ukraine', 'Lviv', 1, 'Android', 'ads'),
 (218, 1, 25, 'Belarus', 'Minsk', 2, 'iOS', 'ads')]

Задание 5
Подсчитайте средний возраст пользователей в разрезе страны. В ответ напишите средний возраст пользователей из Кипра. Ответ округлите до двух знаков после точки.

In [8]:
%%sql

SELECT ROUND(AVG(age), 2)
FROM "user"
WHERE country = 'Cyprus'

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
1 rows affected.

[(Decimal('28.07'),)]

In [9]:
%%sql

SELECT country, ROUND(AVG(age), 2) 
FROM "user"
GROUP BY country
HAVING country = 'Cyprus'

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
1 rows affected.

[('Cyprus', Decimal('28.07'))]

Задание 6

Сгруппируйте пользователей сначала по экспериментальной группе, а затем по операционной системе. В каждой группе подсчитайте количество пользователей, максимальный и минимальный возраст.

Сохраните результаты в файл CSV колонками exp_group, os, total_users, max_age, min_age (обратите внимание на название последних трех колонок!), используя запятую в качестве сепаратора, и отправьте файл в LMS.

Для сохранения в CSV в Redash внизу есть кнопка "три точки", где выпадает пункт "Download as CSV file".

In [10]:
%%sql

SELECT exp_group, os, COUNT(id), MAX(age), MIN(age) 
FROM "user"
GROUP BY (exp_group, os)

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
10 rows affected.

[(0, 'Android', 21234, 95, 14),
 (0, 'iOS', 11489, 79, 14),
 (1, 'Android', 21232, 92, 14),
 (1, 'iOS', 11406, 87, 14),
 (2, 'Android', 21102, 78, 14),
 (2, 'iOS', 11512, 74, 14),
 (3, 'Android', 21319, 84, 14),
 (3, 'iOS', 11449, 85, 14),
 (4, 'Android', 21085, 84, 14),
 (4, 'iOS', 11377, 78, 14)]

Задание 7

В каждой категории постов определите длину самого длинного текста, используя таблицу post. В ответ отправьте тему, у которой длина самого большого поста равна по порядку 25 000.

In [11]:
%%sql

SELECT * 
FROM post
LIMIT 2

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
2 rows affected.

[(1, 'UK economy facing major risks\n\nThe UK manufacturing sector will continue to face serious challenges over the next two years, the British Chamber of ... (1680 characters truncated) ... celerate significantly over the next 12-18 months, it is unlikely that investment and exports will rise sufficiently strongly to pick up the slack.\n', 'business'),
 (2, 'Aids and climate top Davos agenda\n\nClimate change and the fight against Aids are leading the list of concerns for the first day of the World Econom ... (2416 characters truncated) ... onfident than their European counterparts. But the political discussions, focusing on Iran, Iraq and China, are likely to dominate media attention.\n', 'business')]

In [12]:
%%sql

SELECT topic, MAX(LENGTH(text))
FROM post
GROUP BY topic

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
7 rows affected.

[('tech', 16063),
 ('covid', 148),
 ('movie', 10234),
 ('entertainment', 19004),
 ('politics', 25392),
 ('sport', 9438),
 ('business', 5378)]

Задание 8

Найдите страну с наименьшим числом пользователей среди стран, у которых общее число пользователей больше 1000. Введите ее название на английском.

In [13]:
%%sql

SELECT country, COUNT(id)
FROM "user"
GROUP BY country
HAVING COUNT(id) > 1000
ORDER BY COUNT(id)

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
7 rows affected.

[('Azerbaijan', 1542),
 ('Finland', 1599),
 ('Turkey', 1606),
 ('Kazakhstan', 3172),
 ('Belarus', 3293),
 ('Ukraine', 8273),
 ('Russia', 143035)]

Задание 10

Отберите для пользователей из Москвы экспериментальные группы, в которых средний возраст больше 27.2. Напишите через пробел число пользователей в этих группах.

In [14]:
%%sql

SELECT exp_group, COUNT(id)
FROM "user"
WHERE city = 'Moscow'
GROUP BY exp_group
HAVING AVG(age) > 27.2

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
2 rows affected.

[(1, 4414), (3, 4378)]

Задание 11

Сейчас мы будем работать с другой таблицей под названием post. Найдите в таблице post 3 темы с наибольшим количеством постов. Напишите через пробел названия этих тем.

In [15]:
%%sql

SELECT topic, COUNT(text)
FROM post
GROUP BY topic
ORDER BY COUNT(text) DESC
LIMIT 3

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
3 rows affected.

[('movie', 3000), ('covid', 1799), ('sport', 510)]

Задание 12

Отберите пользователей из Воронежа (Voronezh) и отсортируйте их по возрасту в убывающем порядке. Для равных возрастов отсортируйте по возрастанию экспериментальной группы.

Напишите ID второго в порядке выдачи пользователя.

In [16]:
%%sql

SELECT *
FROM "user"
WHERE city = 'Voronezh'
ORDER BY age DESC, exp_group
LIMIT 2

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
2 rows affected.

[(89990, 0, 71, 'Russia', 'Voronezh', 0, 'Android', 'ads'),
 (2441, 1, 71, 'Russia', 'Voronezh', 3, 'Android', 'ads')]

Задание 13

Отберите post_id, time, age и os пользователя для всех лайков пользователей из Омска. Отсортируйте результаты по убыванию времени действия и загрузите в LMS первые 100 значений в формате CSV (сепаратор "запятая", колонки с теми же названиями, что и в задании).

In [17]:
%%sql

SELECT *
FROM feed_action
LIMIT 5

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
5 rows affected.

[(159980, 4301, 'view', datetime.datetime(2021, 12, 18, 11, 29, 18)),
 (144962, 4301, 'view', datetime.datetime(2021, 12, 18, 11, 29, 18)),
 (166682, 4408, 'view', datetime.datetime(2021, 12, 18, 11, 29, 18)),
 (158237, 4287, 'view', datetime.datetime(2021, 12, 18, 11, 29, 18)),
 (124773, 4372, 'like', datetime.datetime(2021, 12, 18, 11, 29, 18))]

In [18]:
%%sql

SELECT post_id, time, age, os
FROM feed_action fa
LEFT JOIN "user" u on fa.user_id = u.id
WHERE fa.action = 'like' AND u.city = 'Omsk'
ORDER BY time DESC
LIMIT 100

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
100 rows affected.

[(7159, datetime.datetime(2022, 1, 26, 23, 59, 54), 17, 'Android'),
 (7184, datetime.datetime(2022, 1, 26, 23, 56, 30), 17, 'Android'),
 (7265, datetime.datetime(2022, 1, 26, 23, 56, 3), 17, 'Android'),
 (7256, datetime.datetime(2022, 1, 26, 23, 55, 24), 17, 'Android'),
 (7080, datetime.datetime(2022, 1, 26, 23, 55, 12), 17, 'Android'),
 (7163, datetime.datetime(2022, 1, 26, 23, 54, 36), 20, 'iOS'),
 (7174, datetime.datetime(2022, 1, 26, 23, 54, 29), 20, 'iOS'),
 (7315, datetime.datetime(2022, 1, 26, 23, 54, 28), 20, 'iOS'),
 (7280, datetime.datetime(2022, 1, 26, 23, 54, 19), 22, 'Android'),
 (6943, datetime.datetime(2022, 1, 26, 23, 52, 29), 20, 'iOS'),
 (7242, datetime.datetime(2022, 1, 26, 23, 52, 1), 20, 'iOS'),
 (7192, datetime.datetime(2022, 1, 26, 23, 51, 36), 22, 'Android'),
 (7251, datetime.datetime(2022, 1, 26, 23, 50, 50), 22, 'Android'),
 (7184, datetime.datetime(2022, 1, 26, 23, 50, 42), 20, 'iOS'),
 (7168, datetime.datetime(2022, 1, 26, 23, 50, 7), 22, 'Android'),
 (7213, datetime.datetime(2022, 1, 26, 23, 49, 1), 41, 'iOS'),
 (7257, datetime.datetime(2022, 1, 26, 23, 49), 36, 'iOS'),
 (7137, datetime.datetime(2022, 1, 26, 23, 48, 48), 41, 'iOS'),
 (7256, datetime.datetime(2022, 1, 26, 23, 48, 45), 36, 'iOS'),
 (7003, datetime.datetime(2022, 1, 26, 23, 48, 40), 36, 'iOS'),
 (7175, datetime.datetime(2022, 1, 26, 23, 48, 39), 36, 'iOS'),
 (7272, datetime.datetime(2022, 1, 26, 23, 48, 17), 36, 'iOS'),
 (7244, datetime.datetime(2022, 1, 26, 23, 47, 4), 41, 'iOS'),
 (7125, datetime.datetime(2022, 1, 26, 23, 45, 58), 36, 'iOS'),
 (7283, datetime.datetime(2022, 1, 26, 23, 45), 41, 'iOS'),
 (7292, datetime.datetime(2022, 1, 26, 23, 44, 56), 29, 'Android'),
 (7259, datetime.datetime(2022, 1, 26, 23, 44, 43), 29, 'Android'),
 (6943, datetime.datetime(2022, 1, 26, 23, 44, 43), 53, 'iOS'),
 (7202, datetime.datetime(2022, 1, 26, 23, 44, 41), 29, 'Android'),
 (7264, datetime.datetime(2022, 1, 26, 23, 44, 12), 53, 'iOS'),
 (7208, datetime.datetime(2022, 1, 26, 23, 43, 21), 53, 'iOS'),
 (7174, datetime.datetime(2022, 1, 26, 23, 43, 1), 53, 'iOS'),
 (7260, datetime.datetime(2022, 1, 26, 23, 42, 49), 53, 'iOS'),
 (7285, datetime.datetime(2022, 1, 26, 23, 42, 30), 53, 'iOS'),
 (7204, datetime.datetime(2022, 1, 26, 23, 42, 3), 53, 'iOS'),
 (7157, datetime.datetime(2022, 1, 26, 23, 41, 41), 29, 'Android'),
 (7268, datetime.datetime(2022, 1, 26, 23, 41, 14), 53, 'iOS'),
 (7059, datetime.datetime(2022, 1, 26, 23, 41, 2), 29, 'Android'),
 (7256, datetime.datetime(2022, 1, 26, 23, 40, 32), 53, 'iOS'),
 (7226, datetime.datetime(2022, 1, 26, 23, 39, 39), 39, 'Android'),
 (7309, datetime.datetime(2022, 1, 26, 23, 39, 38), 21, 'Android'),
 (7159, datetime.datetime(2022, 1, 26, 23, 39, 37), 39, 'Android'),
 (7249, datetime.datetime(2022, 1, 26, 23, 39, 29), 21, 'Android'),
 (7003, datetime.datetime(2022, 1, 26, 23, 39, 22), 21, 'Android'),
 (7097, datetime.datetime(2022, 1, 26, 23, 39, 5), 39, 'Android'),
 (7274, datetime.datetime(2022, 1, 26, 23, 38, 55), 39, 'Android'),
 (7217, datetime.datetime(2022, 1, 26, 23, 38, 51), 21, 'Android'),
 (7003, datetime.datetime(2022, 1, 26, 23, 38, 38), 40, 'iOS'),
 (7303, datetime.datetime(2022, 1, 26, 23, 38, 23), 21, 'Android'),
 (7125, datetime.datetime(2022, 1, 26, 23, 38, 12), 45, 'Android'),
 (7299, datetime.datetime(2022, 1, 26, 23, 38, 4), 21, 'Android'),
 (7180, datetime.datetime(2022, 1, 26, 23, 37, 51), 32, 'Android'),
 (7306, datetime.datetime(2022, 1, 26, 23, 37, 37), 39, 'Android'),
 (7294, datetime.datetime(2022, 1, 26, 23, 37, 29), 21, 'Android'),
 (7254, datetime.datetime(2022, 1, 26, 23, 37, 27), 32, 'Android'),
 (7303, datetime.datetime(2022, 1, 26, 23, 37, 25), 45, 'Android'),
 (7159, datetime.datetime(2022, 1, 26, 23, 37, 12), 21, 'Android'),
 (7272, datetime.datetime(2022, 1, 26, 23, 36, 47), 39, 'Android'),
 (7080, datetime.datetime(2022, 1, 26, 23, 36, 7), 21, 'Android'),
 (7294, datetime.datetime(2022, 1, 26, 23, 35, 44), 32, 'Android'),
 (7244, datetime.datetime(2022, 1, 26, 23, 35, 35), 45, 'Android'),
 (7204, datetime.datetime(2022, 1, 26, 23, 34, 44), 16, 'iOS'),
 (6957, datetime.datetime(2022, 1, 26, 23, 33, 56), 16, 'iOS'),
 (7283, datetime.datetime(2022, 1, 26, 23, 33, 11), 16, 'iOS'),
 (7085, datetime.datetime(2022, 1, 26, 23, 32, 10), 16, 'iOS'),
 (7277, datetime.datetime(2022, 1, 26, 23, 31, 17), 16, 'iOS'),
 (7302, datetime.datetime(2022, 1, 26, 23, 30, 5), 16, 'iOS'),
 (7164, datetime.datetime(2022, 1, 26, 23, 21, 48), 73, 'iOS'),
 (7115, datetime.datetime(2022, 1, 26, 23, 21, 8), 73, 'iOS'),
 (7159, datetime.datetime(2022, 1, 26, 23, 20, 37), 73, 'iOS'),
 (7157, datetime.datetime(2022, 1, 26, 23, 14, 57), 39, 'Android'),
 (7198, datetime.datetime(2022, 1, 26, 23, 14, 56), 46, 'iOS'),
 (7185, datetime.datetime(2022, 1, 26, 23, 13, 2), 46, 'iOS'),
 (7164, datetime.datetime(2022, 1, 26, 23, 11, 49), 39, 'Android'),
 (7299, datetime.datetime(2022, 1, 26, 23, 10, 50), 46, 'iOS'),
 (7168, datetime.datetime(2022, 1, 26, 23, 10, 30), 46, 'iOS'),
 (7283, datetime.datetime(2022, 1, 26, 23, 10, 24), 39, 'Android'),
 (7251, datetime.datetime(2022, 1, 26, 23, 8, 30), 32, 'Android'),
 (7268, datetime.datetime(2022, 1, 26, 22, 59, 46), 22, 'Android'),
 (7157, datetime.datetime(2022, 1, 26, 22, 59, 11), 31, 'iOS'),
 (7317, datetime.datetime(2022, 1, 26, 22, 58, 50), 34, 'Android'),
 (7286, datetime.datetime(2022, 1, 26, 22, 58, 6), 34, 'Android'),
 (7292, datetime.datetime(2022, 1, 26, 22, 58, 4), 34, 'Android'),
 (7283, datetime.datetime(2022, 1, 26, 22, 57, 49), 22, 'Android'),
 (7283, datetime.datetime(2022, 1, 26, 22, 57, 43), 34, 'Android'),
 (7191, datetime.datetime(2022, 1, 26, 22, 56, 26), 31, 'iOS'),
 (7226, datetime.datetime(2022, 1, 26, 22, 56, 19), 22, 'Android'),
 (7059, datetime.datetime(2022, 1, 26, 22, 55, 41), 22, 'Android'),
 (7238, datetime.datetime(2022, 1, 26, 22, 55, 25), 34, 'Android'),
 (7272, datetime.datetime(2022, 1, 26, 22, 55, 4), 31, 'iOS'),
 (7294, datetime.datetime(2022, 1, 26, 22, 48, 58), 22, 'Android'),
 (7184, datetime.datetime(2022, 1, 26, 22, 45, 23), 22, 'Android'),
 (7087, datetime.datetime(2022, 1, 26, 22, 44, 49), 31, 'Android'),
 (7125, datetime.datetime(2022, 1, 26, 22, 44, 1), 31, 'Android'),
 (7272, datetime.datetime(2022, 1, 26, 22, 44), 31, 'Android'),
 (7256, datetime.datetime(2022, 1, 26, 22, 43, 54), 31, 'Android'),
 (7316, datetime.datetime(2022, 1, 26, 22, 42, 54), 31, 'Android'),
 (7319, datetime.datetime(2022, 1, 26, 22, 39, 35), 36, 'iOS'),
 (7268, datetime.datetime(2022, 1, 26, 22, 39, 4), 36, 'iOS'),
 (7226, datetime.datetime(2022, 1, 26, 22, 35, 11), 36, 'iOS')]

Задание 14

Найдите город, пользователи которого в возрасте 36 лет 2021-12-01 числа просмотрели запись на тему covid меньше всего раз относительно других городов. Введите его название на английском.

In [19]:
%%sql

SELECT city, COUNT(action)
FROM feed_action fa
LEFT JOIN "user" u on fa.user_id = u.id LEFT JOIN post p on 
fa.post_id = p.id
WHERE DATE(time) = '2021-12-01' AND p.topic = 'covid' AND u.age = 36
GROUP BY city
ORDER by COUNT(action)
LIMIT 10

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
10 rows affected.

[('Arkhangelsk', 6),
 ('Fryazino', 9),
 ('Apsheronsk', 10),
 ('Lubny', 10),
 ('Mariinsk', 11),
 ('Kirs', 11),
 ('Karmaskaly', 12),
 ('Chita', 12),
 ('Varna', 12),
 ('Usol’ye-Sibirskoye', 13)]

Задание 15

Напишите SQL запрос, используя который вы получите:
- топ N постов по лайкам,
- количество пролайкавших пользователей,
- время последнего лайка.

В качестве ответа напишите через пробел первые 3 ID постов из этого топа.

Сохраните запрос, он может понадобиться в будущем в финальном проекте.

In [20]:
%%sql

SELECT post_id, COUNT(user_id), MAX(time)
FROM feed_action fa
LEFT JOIN "user" u on fa.user_id = u.id LEFT JOIN post p on 
fa.post_id = p.id
WHERE fa.action = 'like'
GROUP BY post_id
ORDER by COUNT(action) DESC
LIMIT 3

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
3 rows affected.

[(4866, 31714, datetime.datetime(2022, 1, 1, 13, 57, 43)),
 (5127, 29637, datetime.datetime(2022, 1, 5, 13, 52, 17)),
 (6448, 27939, datetime.datetime(2022, 1, 22, 5, 50, 39))]